Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.analysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.loadGroupId
The identifier of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.compatible
This indicates whether the load group is compatible.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.direction
The direction of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.incompatible
This indicates whether the load group is incompatible.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.name
The name of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.type
The type of the load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.ToStruct(Tekla.Structures.Analysis.AnalysisLoadGroup)
DO NOT USE! For internal usage only!
loadGroup: The analysis load group.

Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup.FromStruct(Tekla.Structures.Analysis.AnalysisLoadGroup)
DO NOT USE! For internal usage only!
loadGroup: The analysis load group.